app/Controllers/Admin/AdminController.php

SELECT *
FROM `user`
---
    public function login()
    {
        $users = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $cek = $users->get()->getRowArray();