app/Controllers/Barang/BarangKeluarController.php

    public function tampilKode()
    {
        $data = [
            'barang' => $this->dataBarangKeluar->where('id_barang', $_POST['daterange']->first())
        ];
---
SELECT *
FROM `barang_keluar`
WHERE `id_barang` IS NULL
 LIMIT 1