app/Controllers/Barang/BarangController.php

SELECT COUNT(*) AS `numrows` FROM `barang`
---
    public function index()
    {

        $data = [
            'jumlah' => $this->dataBarang->countAll(),
            'judul' => 'Dashboard',
            'aktif' => 'active',
            'aktif2' => '',
            'aktif3' => ''
        ];