app/Models/BarangKeluarModel.php

    public function join()
    {
        return $this->db->table('barang_keluar')
            ->join('barang', 'barang.id_barang = barang_keluar.id_barang')
            ->get()->getResultArray();
---
SELECT *
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id_barang` = `barang_keluar`.`id_barang`